---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.SetLossFactor(Autodesk.Revit.DB.Lighting.LossFactor)
source: html/8cec0b52-0c27-b59d-2751-3fef3e996676.htm
---
# Autodesk.Revit.DB.Lighting.LightType.SetLossFactor Method

Replace the current loss factor object with the given object

## Syntax (C#)
```csharp
public void SetLossFactor(
	LossFactor lossFactor
)
```

## Parameters
- **lossFactor** (`Autodesk.Revit.DB.Lighting.LossFactor`) - An object derived from a LossFactor object

## Remarks
The argument object is cloned

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null